Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/spi.h
/*
 * Component description for SPI
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_SPI_COMPONENT_H_
#define _SAMA5D_SPI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SPI                                          */
/* ************************************************************************** */

/* -------- SPI_CR : (SPI Offset: 0x00) ( /W 32) Control Register -------- */
#define SPI_CR_SPIEN_Pos                      _UINT32_(0)                                          /* (SPI_CR) SPI Enable Position */
#define SPI_CR_SPIEN_Msk                      (_UINT32_(0x1) << SPI_CR_SPIEN_Pos)                  /* (SPI_CR) SPI Enable Mask */
#define SPI_CR_SPIEN(value)                   (SPI_CR_SPIEN_Msk & (_UINT32_(value) << SPI_CR_SPIEN_Pos)) /* Assigment of value for SPIEN in the SPI_CR register */
#define SPI_CR_SPIDIS_Pos                     _UINT32_(1)                                          /* (SPI_CR) SPI Disable Position */
#define SPI_CR_SPIDIS_Msk                     (_UINT32_(0x1) << SPI_CR_SPIDIS_Pos)                 /* (SPI_CR) SPI Disable Mask */
#define SPI_CR_SPIDIS(value)                  (SPI_CR_SPIDIS_Msk & (_UINT32_(value) << SPI_CR_SPIDIS_Pos)) /* Assigment of value for SPIDIS in the SPI_CR register */
#define SPI_CR_SWRST_Pos                      _UINT32_(7)                                          /* (SPI_CR) SPI Software Reset Position */
#define SPI_CR_SWRST_Msk                      (_UINT32_(0x1) << SPI_CR_SWRST_Pos)                  /* (SPI_CR) SPI Software Reset Mask */
#define SPI_CR_SWRST(value)                   (SPI_CR_SWRST_Msk & (_UINT32_(value) << SPI_CR_SWRST_Pos)) /* Assigment of value for SWRST in the SPI_CR register */
#define SPI_CR_REQCLR_Pos                     _UINT32_(12)                                         /* (SPI_CR) Request to Clear the Comparison Trigger Position */
#define SPI_CR_REQCLR_Msk                     (_UINT32_(0x1) << SPI_CR_REQCLR_Pos)                 /* (SPI_CR) Request to Clear the Comparison Trigger Mask */
#define SPI_CR_REQCLR(value)                  (SPI_CR_REQCLR_Msk & (_UINT32_(value) << SPI_CR_REQCLR_Pos)) /* Assigment of value for REQCLR in the SPI_CR register */
#define SPI_CR_TXFCLR_Pos                     _UINT32_(16)                                         /* (SPI_CR) Transmit FIFO Clear Position */
#define SPI_CR_TXFCLR_Msk                     (_UINT32_(0x1) << SPI_CR_TXFCLR_Pos)                 /* (SPI_CR) Transmit FIFO Clear Mask */
#define SPI_CR_TXFCLR(value)                  (SPI_CR_TXFCLR_Msk & (_UINT32_(value) << SPI_CR_TXFCLR_Pos)) /* Assigment of value for TXFCLR in the SPI_CR register */
#define SPI_CR_RXFCLR_Pos                     _UINT32_(17)                                         /* (SPI_CR) Receive FIFO Clear Position */
#define SPI_CR_RXFCLR_Msk                     (_UINT32_(0x1) << SPI_CR_RXFCLR_Pos)                 /* (SPI_CR) Receive FIFO Clear Mask */
#define SPI_CR_RXFCLR(value)                  (SPI_CR_RXFCLR_Msk & (_UINT32_(value) << SPI_CR_RXFCLR_Pos)) /* Assigment of value for RXFCLR in the SPI_CR register */
#define SPI_CR_LASTXFER_Pos                   _UINT32_(24)                                         /* (SPI_CR) Last Transfer Position */
#define SPI_CR_LASTXFER_Msk                   (_UINT32_(0x1) << SPI_CR_LASTXFER_Pos)               /* (SPI_CR) Last Transfer Mask */
#define SPI_CR_LASTXFER(value)                (SPI_CR_LASTXFER_Msk & (_UINT32_(value) << SPI_CR_LASTXFER_Pos)) /* Assigment of value for LASTXFER in the SPI_CR register */
#define SPI_CR_FIFOEN_Pos                     _UINT32_(30)                                         /* (SPI_CR) FIFO Enable Position */
#define SPI_CR_FIFOEN_Msk                     (_UINT32_(0x1) << SPI_CR_FIFOEN_Pos)                 /* (SPI_CR) FIFO Enable Mask */
#define SPI_CR_FIFOEN(value)                  (SPI_CR_FIFOEN_Msk & (_UINT32_(value) << SPI_CR_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SPI_CR register */
#define SPI_CR_FIFODIS_Pos                    _UINT32_(31)                                         /* (SPI_CR) FIFO Disable Position */
#define SPI_CR_FIFODIS_Msk                    (_UINT32_(0x1) << SPI_CR_FIFODIS_Pos)                /* (SPI_CR) FIFO Disable Mask */
#define SPI_CR_FIFODIS(value)                 (SPI_CR_FIFODIS_Msk & (_UINT32_(value) << SPI_CR_FIFODIS_Pos)) /* Assigment of value for FIFODIS in the SPI_CR register */
#define SPI_CR_Msk                            _UINT32_(0xC1031083)                                 /* (SPI_CR) Register Mask  */


/* -------- SPI_MR : (SPI Offset: 0x04) (R/W 32) Mode Register -------- */
#define SPI_MR_MSTR_Pos                       _UINT32_(0)                                          /* (SPI_MR) Master/Slave Mode Position */
#define SPI_MR_MSTR_Msk                       (_UINT32_(0x1) << SPI_MR_MSTR_Pos)                   /* (SPI_MR) Master/Slave Mode Mask */
#define SPI_MR_MSTR(value)                    (SPI_MR_MSTR_Msk & (_UINT32_(value) << SPI_MR_MSTR_Pos)) /* Assigment of value for MSTR in the SPI_MR register */
#define   SPI_MR_MSTR_MASTER_Val              _UINT32_(0x1)                                        /* (SPI_MR) Master  */
#define   SPI_MR_MSTR_SLAVE_Val               _UINT32_(0x0)                                        /* (SPI_MR) Slave  */
#define SPI_MR_MSTR_MASTER                    (SPI_MR_MSTR_MASTER_Val << SPI_MR_MSTR_Pos)          /* (SPI_MR) Master Position  */
#define SPI_MR_MSTR_SLAVE                     (SPI_MR_MSTR_SLAVE_Val << SPI_MR_MSTR_Pos)           /* (SPI_MR) Slave Position  */
#define SPI_MR_PS_Pos                         _UINT32_(1)                                          /* (SPI_MR) Peripheral Select Position */
#define SPI_MR_PS_Msk                         (_UINT32_(0x1) << SPI_MR_PS_Pos)                     /* (SPI_MR) Peripheral Select Mask */
#define SPI_MR_PS(value)                      (SPI_MR_PS_Msk & (_UINT32_(value) << SPI_MR_PS_Pos)) /* Assigment of value for PS in the SPI_MR register */
#define SPI_MR_PCSDEC_Pos                     _UINT32_(2)                                          /* (SPI_MR) Chip Select Decode Position */
#define SPI_MR_PCSDEC_Msk                     (_UINT32_(0x1) << SPI_MR_PCSDEC_Pos)                 /* (SPI_MR) Chip Select Decode Mask */
#define SPI_MR_PCSDEC(value)                  (SPI_MR_PCSDEC_Msk & (_UINT32_(value) << SPI_MR_PCSDEC_Pos)) /* Assigment of value for PCSDEC in the SPI_MR register */
#define SPI_MR_BRSRCCLK_Pos                   _UINT32_(3)                                          /* (SPI_MR) Bit Rate Source Clock Position */
#define SPI_MR_BRSRCCLK_Msk                   (_UINT32_(0x1) << SPI_MR_BRSRCCLK_Pos)               /* (SPI_MR) Bit Rate Source Clock Mask */
#define SPI_MR_BRSRCCLK(value)                (SPI_MR_BRSRCCLK_Msk & (_UINT32_(value) << SPI_MR_BRSRCCLK_Pos)) /* Assigment of value for BRSRCCLK in the SPI_MR register */
#define   SPI_MR_BRSRCCLK_PERIPH_CLK_Val      _UINT32_(0x0)                                        /* (SPI_MR) The peripheral clock is the source clock for the bit rate generation.  */
#define   SPI_MR_BRSRCCLK_GCLK_Val            _UINT32_(0x1)                                        /* (SPI_MR) PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.  */
#define SPI_MR_BRSRCCLK_PERIPH_CLK            (SPI_MR_BRSRCCLK_PERIPH_CLK_Val << SPI_MR_BRSRCCLK_Pos) /* (SPI_MR) The peripheral clock is the source clock for the bit rate generation. Position  */
#define SPI_MR_BRSRCCLK_GCLK                  (SPI_MR_BRSRCCLK_GCLK_Val << SPI_MR_BRSRCCLK_Pos)    /* (SPI_MR) PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock. Position  */
#define SPI_MR_MODFDIS_Pos                    _UINT32_(4)                                          /* (SPI_MR) Mode Fault Detection Position */
#define SPI_MR_MODFDIS_Msk                    (_UINT32_(0x1) << SPI_MR_MODFDIS_Pos)                /* (SPI_MR) Mode Fault Detection Mask */
#define SPI_MR_MODFDIS(value)                 (SPI_MR_MODFDIS_Msk & (_UINT32_(value) << SPI_MR_MODFDIS_Pos)) /* Assigment of value for MODFDIS in the SPI_MR register */
#define SPI_MR_WDRBT_Pos                      _UINT32_(5)                                          /* (SPI_MR) Wait Data Read Before Transfer Position */
#define SPI_MR_WDRBT_Msk                      (_UINT32_(0x1) << SPI_MR_WDRBT_Pos)                  /* (SPI_MR) Wait Data Read Before Transfer Mask */
#define SPI_MR_WDRBT(value)                   (SPI_MR_WDRBT_Msk & (_UINT32_(value) << SPI_MR_WDRBT_Pos)) /* Assigment of value for WDRBT in the SPI_MR register */
#define SPI_MR_LLB_Pos                        _UINT32_(7)                                          /* (SPI_MR) Local Loopback Enable Position */
#define SPI_MR_LLB_Msk                        (_UINT32_(0x1) << SPI_MR_LLB_Pos)                    /* (SPI_MR) Local Loopback Enable Mask */
#define SPI_MR_LLB(value)                     (SPI_MR_LLB_Msk & (_UINT32_(value) << SPI_MR_LLB_Pos)) /* Assigment of value for LLB in the SPI_MR register */
#define SPI_MR_LSBHALF_Pos                    _UINT32_(8)                                          /* (SPI_MR) LSB Timing Selection Position */
#define SPI_MR_LSBHALF_Msk                    (_UINT32_(0x1) << SPI_MR_LSBHALF_Pos)                /* (SPI_MR) LSB Timing Selection Mask */
#define SPI_MR_LSBHALF(value)                 (SPI_MR_LSBHALF_Msk & (_UINT32_(value) << SPI_MR_LSBHALF_Pos)) /* Assigment of value for LSBHALF in the SPI_MR register */
#define SPI_MR_CMPMODE_Pos                    _UINT32_(12)                                         /* (SPI_MR) Comparison Mode Position */
#define SPI_MR_CMPMODE_Msk                    (_UINT32_(0x1) << SPI_MR_CMPMODE_Pos)                /* (SPI_MR) Comparison Mode Mask */
#define SPI_MR_CMPMODE(value)                 (SPI_MR_CMPMODE_Msk & (_UINT32_(value) << SPI_MR_CMPMODE_Pos)) /* Assigment of value for CMPMODE in the SPI_MR register */
#define   SPI_MR_CMPMODE_FLAG_ONLY_Val        _UINT32_(0x0)                                        /* (SPI_MR) Any character is received and comparison function drives CMP flag.  */
#define   SPI_MR_CMPMODE_START_CONDITION_Val  _UINT32_(0x1)                                        /* (SPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set.  */
#define SPI_MR_CMPMODE_FLAG_ONLY              (SPI_MR_CMPMODE_FLAG_ONLY_Val << SPI_MR_CMPMODE_Pos) /* (SPI_MR) Any character is received and comparison function drives CMP flag. Position  */
#define SPI_MR_CMPMODE_START_CONDITION        (SPI_MR_CMPMODE_START_CONDITION_Val << SPI_MR_CMPMODE_Pos) /* (SPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set. Position  */
#define SPI_MR_PCS_Pos                        _UINT32_(16)                                         /* (SPI_MR) Peripheral Chip Select Position */
#define SPI_MR_PCS_Msk                        (_UINT32_(0xF) << SPI_MR_PCS_Pos)                    /* (SPI_MR) Peripheral Chip Select Mask */
#define SPI_MR_PCS(value)                     (SPI_MR_PCS_Msk & (_UINT32_(value) << SPI_MR_PCS_Pos)) /* Assigment of value for PCS in the SPI_MR register */
#define   SPI_MR_PCS_NPCS0_Val                _UINT32_(0xE)                                        /* (SPI_MR) NPCS0 as Chip Select  */
#define   SPI_MR_PCS_NPCS1_Val                _UINT32_(0xD)                                        /* (SPI_MR) NPCS1 as Chip Select  */
#define   SPI_MR_PCS_NPCS2_Val                _UINT32_(0xB)                                        /* (SPI_MR) NPCS2 as Chip Select  */
#define   SPI_MR_PCS_NPCS3_Val                _UINT32_(0x7)                                        /* (SPI_MR) NPCS3 as Chip Select  */
#define SPI_MR_PCS_NPCS0                      (SPI_MR_PCS_NPCS0_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS0 as Chip Select Position  */
#define SPI_MR_PCS_NPCS1                      (SPI_MR_PCS_NPCS1_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS1 as Chip Select Position  */
#define SPI_MR_PCS_NPCS2                      (SPI_MR_PCS_NPCS2_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS2 as Chip Select Position  */
#define SPI_MR_PCS_NPCS3                      (SPI_MR_PCS_NPCS3_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS3 as Chip Select Position  */
#define SPI_MR_DLYBCS_Pos                     _UINT32_(24)                                         /* (SPI_MR) Delay Between Chip Selects Position */
#define SPI_MR_DLYBCS_Msk                     (_UINT32_(0xFF) << SPI_MR_DLYBCS_Pos)                /* (SPI_MR) Delay Between Chip Selects Mask */
#define SPI_MR_DLYBCS(value)                  (SPI_MR_DLYBCS_Msk & (_UINT32_(value) << SPI_MR_DLYBCS_Pos)) /* Assigment of value for DLYBCS in the SPI_MR register */
#define SPI_MR_Msk                            _UINT32_(0xFF0F11BF)                                 /* (SPI_MR) Register Mask  */


