Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/spi.h
/* -------- SPI_IDR : (SPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define SPI_IDR_RDRF_Pos                      _UINT32_(0)                                          /* (SPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define SPI_IDR_RDRF_Msk                      (_UINT32_(0x1) << SPI_IDR_RDRF_Pos)                  /* (SPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define SPI_IDR_RDRF(value)                   (SPI_IDR_RDRF_Msk & (_UINT32_(value) << SPI_IDR_RDRF_Pos)) /* Assigment of value for RDRF in the SPI_IDR register */
#define SPI_IDR_TDRE_Pos                      _UINT32_(1)                                          /* (SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Position */
#define SPI_IDR_TDRE_Msk                      (_UINT32_(0x1) << SPI_IDR_TDRE_Pos)                  /* (SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Mask */
#define SPI_IDR_TDRE(value)                   (SPI_IDR_TDRE_Msk & (_UINT32_(value) << SPI_IDR_TDRE_Pos)) /* Assigment of value for TDRE in the SPI_IDR register */
#define SPI_IDR_MODF_Pos                      _UINT32_(2)                                          /* (SPI_IDR) Mode Fault Error Interrupt Disable Position */
#define SPI_IDR_MODF_Msk                      (_UINT32_(0x1) << SPI_IDR_MODF_Pos)                  /* (SPI_IDR) Mode Fault Error Interrupt Disable Mask */
#define SPI_IDR_MODF(value)                   (SPI_IDR_MODF_Msk & (_UINT32_(value) << SPI_IDR_MODF_Pos)) /* Assigment of value for MODF in the SPI_IDR register */
#define SPI_IDR_OVRES_Pos                     _UINT32_(3)                                          /* (SPI_IDR) Overrun Error Interrupt Disable Position */
#define SPI_IDR_OVRES_Msk                     (_UINT32_(0x1) << SPI_IDR_OVRES_Pos)                 /* (SPI_IDR) Overrun Error Interrupt Disable Mask */
#define SPI_IDR_OVRES(value)                  (SPI_IDR_OVRES_Msk & (_UINT32_(value) << SPI_IDR_OVRES_Pos)) /* Assigment of value for OVRES in the SPI_IDR register */
#define SPI_IDR_NSSR_Pos                      _UINT32_(8)                                          /* (SPI_IDR) NSS Rising Interrupt Disable Position */
#define SPI_IDR_NSSR_Msk                      (_UINT32_(0x1) << SPI_IDR_NSSR_Pos)                  /* (SPI_IDR) NSS Rising Interrupt Disable Mask */
#define SPI_IDR_NSSR(value)                   (SPI_IDR_NSSR_Msk & (_UINT32_(value) << SPI_IDR_NSSR_Pos)) /* Assigment of value for NSSR in the SPI_IDR register */
#define SPI_IDR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (SPI_IDR) Transmission Registers Empty Disable Position */
#define SPI_IDR_TXEMPTY_Msk                   (_UINT32_(0x1) << SPI_IDR_TXEMPTY_Pos)               /* (SPI_IDR) Transmission Registers Empty Disable Mask */
#define SPI_IDR_TXEMPTY(value)                (SPI_IDR_TXEMPTY_Msk & (_UINT32_(value) << SPI_IDR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the SPI_IDR register */
#define SPI_IDR_UNDES_Pos                     _UINT32_(10)                                         /* (SPI_IDR) Underrun Error Interrupt Disable Position */
#define SPI_IDR_UNDES_Msk                     (_UINT32_(0x1) << SPI_IDR_UNDES_Pos)                 /* (SPI_IDR) Underrun Error Interrupt Disable Mask */
#define SPI_IDR_UNDES(value)                  (SPI_IDR_UNDES_Msk & (_UINT32_(value) << SPI_IDR_UNDES_Pos)) /* Assigment of value for UNDES in the SPI_IDR register */
#define SPI_IDR_CMP_Pos                       _UINT32_(11)                                         /* (SPI_IDR) Comparison Interrupt Disable Position */
#define SPI_IDR_CMP_Msk                       (_UINT32_(0x1) << SPI_IDR_CMP_Pos)                   /* (SPI_IDR) Comparison Interrupt Disable Mask */
#define SPI_IDR_CMP(value)                    (SPI_IDR_CMP_Msk & (_UINT32_(value) << SPI_IDR_CMP_Pos)) /* Assigment of value for CMP in the SPI_IDR register */
#define SPI_IDR_TXFEF_Pos                     _UINT32_(24)                                         /* (SPI_IDR) TXFEF Interrupt Disable Position */
#define SPI_IDR_TXFEF_Msk                     (_UINT32_(0x1) << SPI_IDR_TXFEF_Pos)                 /* (SPI_IDR) TXFEF Interrupt Disable Mask */
#define SPI_IDR_TXFEF(value)                  (SPI_IDR_TXFEF_Msk & (_UINT32_(value) << SPI_IDR_TXFEF_Pos)) /* Assigment of value for TXFEF in the SPI_IDR register */
#define SPI_IDR_TXFFF_Pos                     _UINT32_(25)                                         /* (SPI_IDR) TXFFF Interrupt Disable Position */
#define SPI_IDR_TXFFF_Msk                     (_UINT32_(0x1) << SPI_IDR_TXFFF_Pos)                 /* (SPI_IDR) TXFFF Interrupt Disable Mask */
#define SPI_IDR_TXFFF(value)                  (SPI_IDR_TXFFF_Msk & (_UINT32_(value) << SPI_IDR_TXFFF_Pos)) /* Assigment of value for TXFFF in the SPI_IDR register */
#define SPI_IDR_TXFTHF_Pos                    _UINT32_(26)                                         /* (SPI_IDR) TXFTHF Interrupt Disable Position */
#define SPI_IDR_TXFTHF_Msk                    (_UINT32_(0x1) << SPI_IDR_TXFTHF_Pos)                /* (SPI_IDR) TXFTHF Interrupt Disable Mask */
#define SPI_IDR_TXFTHF(value)                 (SPI_IDR_TXFTHF_Msk & (_UINT32_(value) << SPI_IDR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the SPI_IDR register */
#define SPI_IDR_RXFEF_Pos                     _UINT32_(27)                                         /* (SPI_IDR) RXFEF Interrupt Disable Position */
#define SPI_IDR_RXFEF_Msk                     (_UINT32_(0x1) << SPI_IDR_RXFEF_Pos)                 /* (SPI_IDR) RXFEF Interrupt Disable Mask */
#define SPI_IDR_RXFEF(value)                  (SPI_IDR_RXFEF_Msk & (_UINT32_(value) << SPI_IDR_RXFEF_Pos)) /* Assigment of value for RXFEF in the SPI_IDR register */
#define SPI_IDR_RXFFF_Pos                     _UINT32_(28)                                         /* (SPI_IDR) RXFFF Interrupt Disable Position */
#define SPI_IDR_RXFFF_Msk                     (_UINT32_(0x1) << SPI_IDR_RXFFF_Pos)                 /* (SPI_IDR) RXFFF Interrupt Disable Mask */
#define SPI_IDR_RXFFF(value)                  (SPI_IDR_RXFFF_Msk & (_UINT32_(value) << SPI_IDR_RXFFF_Pos)) /* Assigment of value for RXFFF in the SPI_IDR register */
#define SPI_IDR_RXFTHF_Pos                    _UINT32_(29)                                         /* (SPI_IDR) RXFTHF Interrupt Disable Position */
#define SPI_IDR_RXFTHF_Msk                    (_UINT32_(0x1) << SPI_IDR_RXFTHF_Pos)                /* (SPI_IDR) RXFTHF Interrupt Disable Mask */
#define SPI_IDR_RXFTHF(value)                 (SPI_IDR_RXFTHF_Msk & (_UINT32_(value) << SPI_IDR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the SPI_IDR register */
#define SPI_IDR_TXFPTEF_Pos                   _UINT32_(30)                                         /* (SPI_IDR) TXFPTEF Interrupt Disable Position */
#define SPI_IDR_TXFPTEF_Msk                   (_UINT32_(0x1) << SPI_IDR_TXFPTEF_Pos)               /* (SPI_IDR) TXFPTEF Interrupt Disable Mask */
#define SPI_IDR_TXFPTEF(value)                (SPI_IDR_TXFPTEF_Msk & (_UINT32_(value) << SPI_IDR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the SPI_IDR register */
#define SPI_IDR_RXFPTEF_Pos                   _UINT32_(31)                                         /* (SPI_IDR) RXFPTEF Interrupt Disable Position */
#define SPI_IDR_RXFPTEF_Msk                   (_UINT32_(0x1) << SPI_IDR_RXFPTEF_Pos)               /* (SPI_IDR) RXFPTEF Interrupt Disable Mask */
#define SPI_IDR_RXFPTEF(value)                (SPI_IDR_RXFPTEF_Msk & (_UINT32_(value) << SPI_IDR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the SPI_IDR register */
#define SPI_IDR_Msk                           _UINT32_(0xFF000F0F)                                 /* (SPI_IDR) Register Mask  */


/* -------- SPI_IMR : (SPI Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define SPI_IMR_RDRF_Pos                      _UINT32_(0)                                          /* (SPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define SPI_IMR_RDRF_Msk                      (_UINT32_(0x1) << SPI_IMR_RDRF_Pos)                  /* (SPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define SPI_IMR_RDRF(value)                   (SPI_IMR_RDRF_Msk & (_UINT32_(value) << SPI_IMR_RDRF_Pos)) /* Assigment of value for RDRF in the SPI_IMR register */
#define SPI_IMR_TDRE_Pos                      _UINT32_(1)                                          /* (SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Position */
#define SPI_IMR_TDRE_Msk                      (_UINT32_(0x1) << SPI_IMR_TDRE_Pos)                  /* (SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Mask */
#define SPI_IMR_TDRE(value)                   (SPI_IMR_TDRE_Msk & (_UINT32_(value) << SPI_IMR_TDRE_Pos)) /* Assigment of value for TDRE in the SPI_IMR register */
#define SPI_IMR_MODF_Pos                      _UINT32_(2)                                          /* (SPI_IMR) Mode Fault Error Interrupt Mask Position */
#define SPI_IMR_MODF_Msk                      (_UINT32_(0x1) << SPI_IMR_MODF_Pos)                  /* (SPI_IMR) Mode Fault Error Interrupt Mask Mask */
#define SPI_IMR_MODF(value)                   (SPI_IMR_MODF_Msk & (_UINT32_(value) << SPI_IMR_MODF_Pos)) /* Assigment of value for MODF in the SPI_IMR register */
#define SPI_IMR_OVRES_Pos                     _UINT32_(3)                                          /* (SPI_IMR) Overrun Error Interrupt Mask Position */
#define SPI_IMR_OVRES_Msk                     (_UINT32_(0x1) << SPI_IMR_OVRES_Pos)                 /* (SPI_IMR) Overrun Error Interrupt Mask Mask */
#define SPI_IMR_OVRES(value)                  (SPI_IMR_OVRES_Msk & (_UINT32_(value) << SPI_IMR_OVRES_Pos)) /* Assigment of value for OVRES in the SPI_IMR register */
#define SPI_IMR_NSSR_Pos                      _UINT32_(8)                                          /* (SPI_IMR) NSS Rising Interrupt Mask Position */
#define SPI_IMR_NSSR_Msk                      (_UINT32_(0x1) << SPI_IMR_NSSR_Pos)                  /* (SPI_IMR) NSS Rising Interrupt Mask Mask */
#define SPI_IMR_NSSR(value)                   (SPI_IMR_NSSR_Msk & (_UINT32_(value) << SPI_IMR_NSSR_Pos)) /* Assigment of value for NSSR in the SPI_IMR register */
#define SPI_IMR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (SPI_IMR) Transmission Registers Empty Mask Position */
#define SPI_IMR_TXEMPTY_Msk                   (_UINT32_(0x1) << SPI_IMR_TXEMPTY_Pos)               /* (SPI_IMR) Transmission Registers Empty Mask Mask */
#define SPI_IMR_TXEMPTY(value)                (SPI_IMR_TXEMPTY_Msk & (_UINT32_(value) << SPI_IMR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the SPI_IMR register */
#define SPI_IMR_UNDES_Pos                     _UINT32_(10)                                         /* (SPI_IMR) Underrun Error Interrupt Mask Position */
#define SPI_IMR_UNDES_Msk                     (_UINT32_(0x1) << SPI_IMR_UNDES_Pos)                 /* (SPI_IMR) Underrun Error Interrupt Mask Mask */
#define SPI_IMR_UNDES(value)                  (SPI_IMR_UNDES_Msk & (_UINT32_(value) << SPI_IMR_UNDES_Pos)) /* Assigment of value for UNDES in the SPI_IMR register */
#define SPI_IMR_CMP_Pos                       _UINT32_(11)                                         /* (SPI_IMR) Comparison Interrupt Mask Position */
#define SPI_IMR_CMP_Msk                       (_UINT32_(0x1) << SPI_IMR_CMP_Pos)                   /* (SPI_IMR) Comparison Interrupt Mask Mask */
#define SPI_IMR_CMP(value)                    (SPI_IMR_CMP_Msk & (_UINT32_(value) << SPI_IMR_CMP_Pos)) /* Assigment of value for CMP in the SPI_IMR register */
#define SPI_IMR_TXFEF_Pos                     _UINT32_(24)                                         /* (SPI_IMR) TXFEF Interrupt Mask Position */
#define SPI_IMR_TXFEF_Msk                     (_UINT32_(0x1) << SPI_IMR_TXFEF_Pos)                 /* (SPI_IMR) TXFEF Interrupt Mask Mask */
#define SPI_IMR_TXFEF(value)                  (SPI_IMR_TXFEF_Msk & (_UINT32_(value) << SPI_IMR_TXFEF_Pos)) /* Assigment of value for TXFEF in the SPI_IMR register */
#define SPI_IMR_TXFFF_Pos                     _UINT32_(25)                                         /* (SPI_IMR) TXFFF Interrupt Mask Position */
#define SPI_IMR_TXFFF_Msk                     (_UINT32_(0x1) << SPI_IMR_TXFFF_Pos)                 /* (SPI_IMR) TXFFF Interrupt Mask Mask */
#define SPI_IMR_TXFFF(value)                  (SPI_IMR_TXFFF_Msk & (_UINT32_(value) << SPI_IMR_TXFFF_Pos)) /* Assigment of value for TXFFF in the SPI_IMR register */
#define SPI_IMR_TXFTHF_Pos                    _UINT32_(26)                                         /* (SPI_IMR) TXFTHF Interrupt Mask Position */
#define SPI_IMR_TXFTHF_Msk                    (_UINT32_(0x1) << SPI_IMR_TXFTHF_Pos)                /* (SPI_IMR) TXFTHF Interrupt Mask Mask */
#define SPI_IMR_TXFTHF(value)                 (SPI_IMR_TXFTHF_Msk & (_UINT32_(value) << SPI_IMR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the SPI_IMR register */
#define SPI_IMR_RXFEF_Pos                     _UINT32_(27)                                         /* (SPI_IMR) RXFEF Interrupt Mask Position */
#define SPI_IMR_RXFEF_Msk                     (_UINT32_(0x1) << SPI_IMR_RXFEF_Pos)                 /* (SPI_IMR) RXFEF Interrupt Mask Mask */
#define SPI_IMR_RXFEF(value)                  (SPI_IMR_RXFEF_Msk & (_UINT32_(value) << SPI_IMR_RXFEF_Pos)) /* Assigment of value for RXFEF in the SPI_IMR register */
#define SPI_IMR_RXFFF_Pos                     _UINT32_(28)                                         /* (SPI_IMR) RXFFF Interrupt Mask Position */
#define SPI_IMR_RXFFF_Msk                     (_UINT32_(0x1) << SPI_IMR_RXFFF_Pos)                 /* (SPI_IMR) RXFFF Interrupt Mask Mask */
#define SPI_IMR_RXFFF(value)                  (SPI_IMR_RXFFF_Msk & (_UINT32_(value) << SPI_IMR_RXFFF_Pos)) /* Assigment of value for RXFFF in the SPI_IMR register */
#define SPI_IMR_RXFTHF_Pos                    _UINT32_(29)                                         /* (SPI_IMR) RXFTHF Interrupt Mask Position */
#define SPI_IMR_RXFTHF_Msk                    (_UINT32_(0x1) << SPI_IMR_RXFTHF_Pos)                /* (SPI_IMR) RXFTHF Interrupt Mask Mask */
#define SPI_IMR_RXFTHF(value)                 (SPI_IMR_RXFTHF_Msk & (_UINT32_(value) << SPI_IMR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the SPI_IMR register */
#define SPI_IMR_TXFPTEF_Pos                   _UINT32_(30)                                         /* (SPI_IMR) TXFPTEF Interrupt Mask Position */
#define SPI_IMR_TXFPTEF_Msk                   (_UINT32_(0x1) << SPI_IMR_TXFPTEF_Pos)               /* (SPI_IMR) TXFPTEF Interrupt Mask Mask */
#define SPI_IMR_TXFPTEF(value)                (SPI_IMR_TXFPTEF_Msk & (_UINT32_(value) << SPI_IMR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the SPI_IMR register */
#define SPI_IMR_RXFPTEF_Pos                   _UINT32_(31)                                         /* (SPI_IMR) RXFPTEF Interrupt Mask Position */
#define SPI_IMR_RXFPTEF_Msk                   (_UINT32_(0x1) << SPI_IMR_RXFPTEF_Pos)               /* (SPI_IMR) RXFPTEF Interrupt Mask Mask */
#define SPI_IMR_RXFPTEF(value)                (SPI_IMR_RXFPTEF_Msk & (_UINT32_(value) << SPI_IMR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the SPI_IMR register */
#define SPI_IMR_Msk                           _UINT32_(0xFF000F0F)                                 /* (SPI_IMR) Register Mask  */


/* -------- SPI_CSR : (SPI Offset: 0x30) (R/W 32) Chip Select Register -------- */
#define SPI_CSR_CPOL_Pos                      _UINT32_(0)                                          /* (SPI_CSR) Clock Polarity Position */
#define SPI_CSR_CPOL_Msk                      (_UINT32_(0x1) << SPI_CSR_CPOL_Pos)                  /* (SPI_CSR) Clock Polarity Mask */
#define SPI_CSR_CPOL(value)                   (SPI_CSR_CPOL_Msk & (_UINT32_(value) << SPI_CSR_CPOL_Pos)) /* Assigment of value for CPOL in the SPI_CSR register */
#define   SPI_CSR_CPOL_IDLE_LOW_Val           _UINT32_(0x0)                                        /* (SPI_CSR) Clock is low when inactive (CPOL=0)  */
#define   SPI_CSR_CPOL_IDLE_HIGH_Val          _UINT32_(0x1)                                        /* (SPI_CSR) Clock is high when inactive (CPOL=1)  */
#define SPI_CSR_CPOL_IDLE_LOW                 (SPI_CSR_CPOL_IDLE_LOW_Val << SPI_CSR_CPOL_Pos)      /* (SPI_CSR) Clock is low when inactive (CPOL=0) Position  */
#define SPI_CSR_CPOL_IDLE_HIGH                (SPI_CSR_CPOL_IDLE_HIGH_Val << SPI_CSR_CPOL_Pos)     /* (SPI_CSR) Clock is high when inactive (CPOL=1) Position  */
#define SPI_CSR_NCPHA_Pos                     _UINT32_(1)                                          /* (SPI_CSR) Clock Phase Position */
#define SPI_CSR_NCPHA_Msk                     (_UINT32_(0x1) << SPI_CSR_NCPHA_Pos)                 /* (SPI_CSR) Clock Phase Mask */
#define SPI_CSR_NCPHA(value)                  (SPI_CSR_NCPHA_Msk & (_UINT32_(value) << SPI_CSR_NCPHA_Pos)) /* Assigment of value for NCPHA in the SPI_CSR register */
#define   SPI_CSR_NCPHA_VALID_LEADING_EDGE_Val _UINT32_(0x1)                                        /* (SPI_CSR) Data is valid on clock leading edge (NCPHA=1)  */
#define   SPI_CSR_NCPHA_VALID_TRAILING_EDGE_Val _UINT32_(0x0)                                        /* (SPI_CSR) Data is valid on clock trailing edge (NCPHA=0)  */
#define SPI_CSR_NCPHA_VALID_LEADING_EDGE      (SPI_CSR_NCPHA_VALID_LEADING_EDGE_Val << SPI_CSR_NCPHA_Pos) /* (SPI_CSR) Data is valid on clock leading edge (NCPHA=1) Position  */
#define SPI_CSR_NCPHA_VALID_TRAILING_EDGE     (SPI_CSR_NCPHA_VALID_TRAILING_EDGE_Val << SPI_CSR_NCPHA_Pos) /* (SPI_CSR) Data is valid on clock trailing edge (NCPHA=0) Position  */
#define SPI_CSR_CSNAAT_Pos                    _UINT32_(2)                                          /* (SPI_CSR) Chip Select Not Active After Transfer (ignored if CSAAT = 1) Position */
#define SPI_CSR_CSNAAT_Msk                    (_UINT32_(0x1) << SPI_CSR_CSNAAT_Pos)                /* (SPI_CSR) Chip Select Not Active After Transfer (ignored if CSAAT = 1) Mask */
#define SPI_CSR_CSNAAT(value)                 (SPI_CSR_CSNAAT_Msk & (_UINT32_(value) << SPI_CSR_CSNAAT_Pos)) /* Assigment of value for CSNAAT in the SPI_CSR register */
#define SPI_CSR_CSAAT_Pos                     _UINT32_(3)                                          /* (SPI_CSR) Chip Select Active After Transfer Position */
#define SPI_CSR_CSAAT_Msk                     (_UINT32_(0x1) << SPI_CSR_CSAAT_Pos)                 /* (SPI_CSR) Chip Select Active After Transfer Mask */
#define SPI_CSR_CSAAT(value)                  (SPI_CSR_CSAAT_Msk & (_UINT32_(value) << SPI_CSR_CSAAT_Pos)) /* Assigment of value for CSAAT in the SPI_CSR register */
#define SPI_CSR_BITS_Pos                      _UINT32_(4)                                          /* (SPI_CSR) Bits Per Transfer Position */
#define SPI_CSR_BITS_Msk                      (_UINT32_(0xF) << SPI_CSR_BITS_Pos)                  /* (SPI_CSR) Bits Per Transfer Mask */
#define SPI_CSR_BITS(value)                   (SPI_CSR_BITS_Msk & (_UINT32_(value) << SPI_CSR_BITS_Pos)) /* Assigment of value for BITS in the SPI_CSR register */
#define   SPI_CSR_BITS_8_BIT_Val              _UINT32_(0x0)                                        /* (SPI_CSR) 8 bits for transfer  */
#define   SPI_CSR_BITS_9_BIT_Val              _UINT32_(0x1)                                        /* (SPI_CSR) 9 bits for transfer  */
#define   SPI_CSR_BITS_10_BIT_Val             _UINT32_(0x2)                                        /* (SPI_CSR) 10 bits for transfer  */
#define   SPI_CSR_BITS_11_BIT_Val             _UINT32_(0x3)                                        /* (SPI_CSR) 11 bits for transfer  */
#define   SPI_CSR_BITS_12_BIT_Val             _UINT32_(0x4)                                        /* (SPI_CSR) 12 bits for transfer  */
#define   SPI_CSR_BITS_13_BIT_Val             _UINT32_(0x5)                                        /* (SPI_CSR) 13 bits for transfer  */
#define   SPI_CSR_BITS_14_BIT_Val             _UINT32_(0x6)                                        /* (SPI_CSR) 14 bits for transfer  */
#define   SPI_CSR_BITS_15_BIT_Val             _UINT32_(0x7)                                        /* (SPI_CSR) 15 bits for transfer  */
#define   SPI_CSR_BITS_16_BIT_Val             _UINT32_(0x8)                                        /* (SPI_CSR) 16 bits for transfer  */
#define SPI_CSR_BITS_8_BIT                    (SPI_CSR_BITS_8_BIT_Val << SPI_CSR_BITS_Pos)         /* (SPI_CSR) 8 bits for transfer Position  */
#define SPI_CSR_BITS_9_BIT                    (SPI_CSR_BITS_9_BIT_Val << SPI_CSR_BITS_Pos)         /* (SPI_CSR) 9 bits for transfer Position  */
#define SPI_CSR_BITS_10_BIT                   (SPI_CSR_BITS_10_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 10 bits for transfer Position  */
#define SPI_CSR_BITS_11_BIT                   (SPI_CSR_BITS_11_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 11 bits for transfer Position  */
#define SPI_CSR_BITS_12_BIT                   (SPI_CSR_BITS_12_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 12 bits for transfer Position  */
#define SPI_CSR_BITS_13_BIT                   (SPI_CSR_BITS_13_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 13 bits for transfer Position  */
#define SPI_CSR_BITS_14_BIT                   (SPI_CSR_BITS_14_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 14 bits for transfer Position  */
#define SPI_CSR_BITS_15_BIT                   (SPI_CSR_BITS_15_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 15 bits for transfer Position  */
#define SPI_CSR_BITS_16_BIT                   (SPI_CSR_BITS_16_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 16 bits for transfer Position  */
#define SPI_CSR_SCBR_Pos                      _UINT32_(8)                                          /* (SPI_CSR) Serial Clock Bit Rate Position */
#define SPI_CSR_SCBR_Msk                      (_UINT32_(0xFF) << SPI_CSR_SCBR_Pos)                 /* (SPI_CSR) Serial Clock Bit Rate Mask */
#define SPI_CSR_SCBR(value)                   (SPI_CSR_SCBR_Msk & (_UINT32_(value) << SPI_CSR_SCBR_Pos)) /* Assigment of value for SCBR in the SPI_CSR register */
#define SPI_CSR_DLYBS_Pos                     _UINT32_(16)                                         /* (SPI_CSR) Delay Before SPCK Position */
#define SPI_CSR_DLYBS_Msk                     (_UINT32_(0xFF) << SPI_CSR_DLYBS_Pos)                /* (SPI_CSR) Delay Before SPCK Mask */
#define SPI_CSR_DLYBS(value)                  (SPI_CSR_DLYBS_Msk & (_UINT32_(value) << SPI_CSR_DLYBS_Pos)) /* Assigment of value for DLYBS in the SPI_CSR register */
#define SPI_CSR_DLYBCT_Pos                    _UINT32_(24)                                         /* (SPI_CSR) Delay Between Consecutive Transfers Position */
#define SPI_CSR_DLYBCT_Msk                    (_UINT32_(0xFF) << SPI_CSR_DLYBCT_Pos)               /* (SPI_CSR) Delay Between Consecutive Transfers Mask */
#define SPI_CSR_DLYBCT(value)                 (SPI_CSR_DLYBCT_Msk & (_UINT32_(value) << SPI_CSR_DLYBCT_Pos)) /* Assigment of value for DLYBCT in the SPI_CSR register */
#define SPI_CSR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SPI_CSR) Register Mask  */


