Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/spi.h
/** \brief SPI register offsets definitions */
#define SPI_CR_REG_OFST                _UINT32_(0x00)      /* (SPI_CR) Control Register Offset */
#define SPI_MR_REG_OFST                _UINT32_(0x04)      /* (SPI_MR) Mode Register Offset */
#define SPI_RDR_REG_OFST               _UINT32_(0x08)      /* (SPI_RDR) Receive Data Register Offset */
#define SPI_TDR_REG_OFST               _UINT32_(0x0C)      /* (SPI_TDR) Transmit Data Register Offset */
#define SPI_SR_REG_OFST                _UINT32_(0x10)      /* (SPI_SR) Status Register Offset */
#define SPI_IER_REG_OFST               _UINT32_(0x14)      /* (SPI_IER) Interrupt Enable Register Offset */
#define SPI_IDR_REG_OFST               _UINT32_(0x18)      /* (SPI_IDR) Interrupt Disable Register Offset */
#define SPI_IMR_REG_OFST               _UINT32_(0x1C)      /* (SPI_IMR) Interrupt Mask Register Offset */
#define SPI_CSR_REG_OFST               _UINT32_(0x30)      /* (SPI_CSR) Chip Select Register Offset */
#define SPI_CSR0_REG_OFST              _UINT32_(0x30)      /* (SPI_CSR0) Chip Select Register Offset */
#define SPI_CSR1_REG_OFST              _UINT32_(0x34)      /* (SPI_CSR1) Chip Select Register Offset */
#define SPI_CSR2_REG_OFST              _UINT32_(0x38)      /* (SPI_CSR2) Chip Select Register Offset */
#define SPI_CSR3_REG_OFST              _UINT32_(0x3C)      /* (SPI_CSR3) Chip Select Register Offset */
#define SPI_FMR_REG_OFST               _UINT32_(0x40)      /* (SPI_FMR) FIFO Mode Register Offset */
#define SPI_FLR_REG_OFST               _UINT32_(0x44)      /* (SPI_FLR) FIFO Level Register Offset */
#define SPI_CMPR_REG_OFST              _UINT32_(0x48)      /* (SPI_CMPR) Comparison Register Offset */
#define SPI_WPMR_REG_OFST              _UINT32_(0xE4)      /* (SPI_WPMR) Write Protection Mode Register Offset */
#define SPI_WPSR_REG_OFST              _UINT32_(0xE8)      /* (SPI_WPSR) Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SPI register API structure */
typedef struct
{
  __O   uint32_t                       SPI_CR;             /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SPI_MR;             /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint32_t                       SPI_RDR;            /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O   uint32_t                       SPI_TDR;            /**< Offset: 0x0C ( /W  32) Transmit Data Register */
  __I   uint32_t                       SPI_SR;             /**< Offset: 0x10 (R/   32) Status Register */
  __O   uint32_t                       SPI_IER;            /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SPI_IDR;            /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SPI_IMR;            /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SPI_CSR[4];         /**< Offset: 0x30 (R/W  32) Chip Select Register */
  __IO  uint32_t                       SPI_FMR;            /**< Offset: 0x40 (R/W  32) FIFO Mode Register */
  __I   uint32_t                       SPI_FLR;            /**< Offset: 0x44 (R/   32) FIFO Level Register */
  __I   uint32_t                       SPI_CMPR;           /**< Offset: 0x48 (R/   32) Comparison Register */
  __I   uint8_t                        Reserved2[0x98];
  __IO  uint32_t                       SPI_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SPI_WPSR;           /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} spi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D_SPI_COMPONENT_H_ */
